<?php
// +----------------------------------------------------------------------
// | HouCMF [ 用心做好每个站 用心服务好每个客户 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2019 http://www.houjit.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Amos <amos@houjit.com>
// +----------------------------------------------------------------------
// | 系统配置
// +----------------------------------------------------------------------

return [
    'debug' => false, // 建议开发过程中开启
    'session' => [
        'client' => 'file',
        'config' => [
            'savePath' => WORK_PATH . 'storage/sessions',
            'host' => '127.0.0.1',
            'port' => 6379,
            'auth' => null,
            'timeout' => 5,
            'prefix' => 'hou:'
        ],

        'lifetime' => 7200
    ]
];